02. New data and CSVs/RH130/219/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 219;

boundaryField
{
    bypassInlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 290;
        value           uniform 290;
    }
    engine
    {
        type            zeroGradient;
    }
    farfield
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 219;
        value           uniform 219;
    }
    nozzle
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    turbine
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 600;
        value           uniform 600;
    }
    wedgeL
    {
        type            wedge;
    }
    wedgeR
    {
        type            wedge;
    }
}


// ************************************************************************* //
