02. New data and CSVs/RH130/219/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (252 0 0);

boundaryField
{
    bypassInlet
    {
        type            zeroGradient;
    }
    engine
    {
        type            noSlip;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform (252 0 0);
        value           uniform (252 0 0);
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform (252 0 0);
        value           uniform (252 0 0);
    }
    nozzle
    {
        type            noSlip;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (252 0 0);
        value           uniform (252 0 0);
    }
    turbine
    {
        type            zeroGradient;
    }
    wedgeL
    {
        type            wedge;
    }
    wedgeR
    {
        type            wedge;
    }
}


// ************************************************************************* //
