02. New data and CSVs/RH130/219/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    bypassInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 10;
    }
    engine
    {
        type            kqRWallFunction;
        value           uniform 10;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    nozzle
    {
        type            kqRWallFunction;
        value           uniform 10;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    turbine
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 10;
    }
    wedgeL
    {
        type            wedge;
    }
    wedgeR
    {
        type            wedge;
    }
}


// ************************************************************************* //
